# TickMarkPen Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TickMarkPen Property
ParameterTypeId Class See Also
---
"Tick Mark Line Weight"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TickMarkPen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TickMarkPen As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TickMarkPen {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace